In [2]:
import numpy as np
import pandas as pd

# Make a Pandas DataFrame with two-dimensional list

In [8]:
data = [['a',10],['b',20],['c',30],['d',40]]
df = pd.DataFrame(data,columns=['Tag','content'])
df

  Tag  content
0   a       10
1   b       20
2   c       30
3   d       40

# Python | Creating DataFrame from dict of narray/lists

In [10]:
data = {'Name':['Santosh','Sagar','Suraj','Vikas','Vishal'],'Age':[33,34,45,23,56],'Place':['KP','Satara','Sangli','Pune','Vishal']}
df = pd.DataFrame(data,index=['a','b','c','d','e'])
df

      Name  Age   Place
a  Santosh   33      KP
b    Sagar   34  Satara
c    Suraj   45  Sangli
d    Vikas   23    Pune
e   Vishal   56  Vishal

# Creating Pandas dataframe using list of lists

In [11]:
data = [['a',11],['b',12]]
df = pd.DataFrame(data)
df

   0   1
0  a  11
1  b  12

# Creating a Pandas dataframe using list of tuples

In [12]:
data = [('a',10,22),('b',22,34),('c',56,34),('d',21,45)]
df = pd.DataFrame(data)
df

   0   1   2
0  a  10  22
1  b  22  34
2  c  56  34
3  d  21  45

# Python | Convert list of nested dictionary into Pandas dataframe

In [14]:
# List of nested dictionary initialization
list = [
        {
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                   ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                   ],
        "Name": "Chunky Pandey"
        }
       ]
list

[{'Student': [{'Exam': 90, 'Grade': 'a'},
   {'Exam': 99, 'Grade': 'b'},
   {'Exam': 97, 'Grade': 'c'}],
  'Name': 'Paras Jain'},
 {'Student': [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Grade': 'b'}],
  'Name': 'Chunky Pandey'}]

In [16]:
# rows list initialization
rows = []

# appending rows
for data in list:
	data_row = data['Student']
	time = data['Name']
	
	for row in data_row:
		row['Name']= time
		rows.append(row)

# using data frame
df = pd.DataFrame(rows)

# print(df)
df

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey

# Construct a DataFrame in Pandas using string data

In [ ]:
from io import StringIO

# wrap the string data in StringIO function
StringData = StringIO("""Date;Event;Cost
	10/2/2011;Music;10000
	11/2/2011;Poetry;12000
	12/2/2011;Theatre;5000
	13/2/2011;Comedy;8000
	""")
# let's read the data using the Pandas
# read_csv() function
df = pd.read_csv(StringData, sep =";")
# Print the dataframe
print(df)